In [1]:
import pandas as pd

In [12]:
temp_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [33,23,30]
})
temp_df

       city  temperature
0    mumbai           33
1     delhi           23
2  banglore           30

In [13]:
us_df = pd.DataFrame({
    "city": ["mumbai","delhi"],
    "hum": [32,45]
})
# us_df = us_df
us_df

     city  hum
0  mumbai   32
1   delhi   45

In [11]:
res_df = pd.merge(temp_df , us_df , on='city' ,  how = 'inner')
res_df

       city  temperature  hum
0    mumbai           33   32
1     delhi           23   45
2  banglore           30   30

In [15]:
res_df = pd.merge(temp_df , us_df , on='city' ,  how = 'left' , sort=True, indicator=True)
res_df

       city  temperature   hum     _merge
0  banglore           30   NaN  left_only
1     delhi           23  45.0       both
2    mumbai           33  32.0       both

In [17]:
new_df = temp_df.merge( us_df , on='city' , how='left' )
new_df

       city  temperature   hum
0    mumbai           33  32.0
1     delhi           23  45.0
2  banglore           30   NaN